src/purpose.md
```mermaid
flowchart LR
  A_DeviceUser([Building Owner])
  A_ServiceProvider([Security Service Provider])

  subgraph G_System[Demo System]
    subgraph G_Device[Device Functions]
      U_DeviceActivate[Activate Device]
      U_CheckUpdate[Update Anomaly Detection Model]
      U_DeviceUse[Use Anomaly Detection Model]
    end

    subgraph G_TAM[TAM Functions]
      U_TCRegister[Register TC to TAM]
      U_TCInstall[Distribute TC to Device]
      U_ListDevices[List Managed Devices]
      U_ListTCs[List Managed TCs]
      U_DeviceAttest[Verify Device]
    end
  end

  A_DeviceUser --> U_DeviceActivate
  A_DeviceUser --> U_CheckUpdate
  A_DeviceUser --> U_DeviceUse

  U_DeviceActivate -. include .-> U_TCInstall
  U_CheckUpdate -. include .-> U_TCInstall
  U_TCInstall -. include .-> U_DeviceAttest

  A_ServiceProvider --> U_TCRegister
  A_ServiceProvider --> U_ListDevices
  A_ServiceProvider --> U_ListTCs
```
